Revit 2024 API
View.Discipline Property
 The Discipline of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ViewDiscipline Discipline { get; set; }
Visual Basic
Public Property Discipline As ViewDiscipline
	Get
	Set
Visual C++
public:
property ViewDiscipline Discipline {
	ViewDiscipline get ();
	void set (ViewDiscipline value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  View must have a Discipline property -or- When setting this property: View Discipline must be modifiable.
See Also
View Class
Autodesk.Revit.DB Namespace